/********************************************************
   版权所有 (C), 2001-2100, 四川新健康成生物股份有限公司
  -------------------------------------------------------

				嵌入式开发平台——CAN通信模块

  -------------------------------------------------------
   文 件 名   : Drv_CANProtocol.h
   版 本 号   : V1.0.0.0
   作    者   : ryc
   生成日期   : 2019年08月01日
   功能描述   : 定义一种CAN通信协议接口。
   使用方法   ：上层模块通过调用CAN_Init获得一个通信模块的
				指针。
   依赖于     : BSP V1.0.0.0
				uC/OS-II V2.92.07
   注         ：该模块不依赖于硬件电路。 
 ********************************************************/

#ifndef _DRV_CANPROTOCOL_H__
#define _DRV_CANPROTOCOL_H__




#endif
